; domain
(define (domain blocksworld-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types block)
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (increase (total-cost) 1)))
)

; problem
(define (problem blocksworld-problem)
 (:domain blocksworld-domain)
 (:objects
   white_block_1 white_block_2 purple_block_1 red_block_1 white_block_3 orange_block_1 orange_block_2 - block
 )
 (:init (ontable white_block_1) (ontable white_block_2) (on purple_block_1 white_block_1) (on red_block_1 purple_block_1) (ontable white_block_3) (on orange_block_1 red_block_1) (on orange_block_2 white_block_2) (clear white_block_3) (clear orange_block_1) (clear orange_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (on white_block_2 purple_block_1)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack orange_block_1 red_block_1)
   deleted: (on orange_block_1 red_block_1) (clear orange_block_1) (handempty)
   added: (holding orange_block_1) (clear red_block_1)
   goals met: 0 of 1
2. (putdown orange_block_1)
   deleted: (holding orange_block_1)
   added: (clear orange_block_1) (handempty) (ontable orange_block_1)
   goals met: 0 of 1
3. (unstack red_block_1 purple_block_1)
   deleted: (on red_block_1 purple_block_1) (clear red_block_1) (handempty)
   added: (holding red_block_1) (clear purple_block_1)
   goals met: 0 of 1
4. (putdown red_block_1)
   deleted: (holding red_block_1)
   added: (clear red_block_1) (handempty) (ontable red_block_1)
   goals met: 0 of 1
5. (unstack orange_block_2 white_block_2)
   deleted: (on orange_block_2 white_block_2) (clear orange_block_2) (handempty)
   added: (holding orange_block_2) (clear white_block_2)
   goals met: 0 of 1
6. (putdown orange_block_2)
   deleted: (holding orange_block_2)
   added: (clear orange_block_2) (handempty) (ontable orange_block_2)
   goals met: 0 of 1
7. (pickup white_block_2)
   deleted: (clear white_block_2) (ontable white_block_2) (handempty)
   added: (holding white_block_2)
   goals met: 0 of 1
8. (stack white_block_2 purple_block_1)
   deleted: (clear purple_block_1) (holding white_block_2)
   added: (handempty) (clear white_block_2) (on white_block_2 purple_block_1)
   goals met: 1 of 1
